tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPCODR register
//
//*****************************************************************************
#define GPIO_GPCODR_GPIO64        0x1U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO65        0x2U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO66        0x4U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO67        0x8U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO68        0x10U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO69        0x20U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO70        0x40U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO71        0x80U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO72        0x100U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO73        0x200U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO74        0x400U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO75        0x800U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO76        0x1000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO77        0x2000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO78        0x4000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO79        0x8000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO80        0x10000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO81        0x20000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO82        0x40000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO83        0x80000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO84        0x100000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO85        0x200000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO86        0x400000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO87        0x800000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO88        0x1000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO89        0x2000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO90        0x4000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO91        0x8000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO92        0x10000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO93        0x20000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO94        0x40000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPCODR_GPIO95        0x80000000U  // Outpout Open-Drain control
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCGMUX1 register
//
//*****************************************************************************
#define GPIO_GPCGMUX1_GPIO64_S    0U
#define GPIO_GPCGMUX1_GPIO64_M    0x3U         // Defines pin-muxing selection
                                               // for GPIO64
#define GPIO_GPCGMUX1_GPIO65_S    2U
#define GPIO_GPCGMUX1_GPIO65_M    0xCU         // Defines pin-muxing selection
                                               // for GPIO65
#define GPIO_GPCGMUX1_GPIO66_S    4U
#define GPIO_GPCGMUX1_GPIO66_M    0x30U        // Defines pin-muxing selection
                                               // for GPIO66
#define GPIO_GPCGMUX1_GPIO67_S    6U
#define GPIO_GPCGMUX1_GPIO67_M    0xC0U        // Defines pin-muxing selection
                                               // for GPIO67
#define GPIO_GPCGMUX1_GPIO68_S    8U
#define GPIO_GPCGMUX1_GPIO68_M    0x300U       // Defines pin-muxing selection
                                               // for GPIO68
#define GPIO_GPCGMUX1_GPIO69_S    10U
#define GPIO_GPCGMUX1_GPIO69_M    0xC00U       // Defines pin-muxing selection
                                               // for GPIO69
#define GPIO_GPCGMUX1_GPIO70_S    12U
#define GPIO_GPCGMUX1_GPIO70_M    0x3000U      // Defines pin-muxing selection
                                               // for GPIO70
#define GPIO_GPCGMUX1_GPIO71_S    14U
#define GPIO_GPCGMUX1_GPIO71_M    0xC000U      // Defines pin-muxing selection
                                               // for GPIO71
#define GPIO_GPCGMUX1_GPIO72_S    16U
#define GPIO_GPCGMUX1_GPIO72_M    0x30000U     // Defines pin-muxing selection
                                               // for GPIO72
#define GPIO_GPCGMUX1_GPIO73_S    18U
#define GPIO_GPCGMUX1_GPIO73_M    0xC0000U     // Defines pin-muxing selection
                                               // for GPIO73
#define GPIO_GPCGMUX1_GPIO74_S    20U
#define GPIO_GPCGMUX1_GPIO74_M    0x300000U    // Defines pin-muxing selection
                                               // for GPIO74
#define GPIO_GPCGMUX1_GPIO75_S    22U
#define GPIO_GPCGMUX1_GPIO75_M    0xC00000U    // Defines pin-muxing selection
                                               // for GPIO75
#define GPIO_GPCGMUX1_GPIO76_S    24U
#define GPIO_GPCGMUX1_GPIO76_M    0x3000000U   // Defines pin-muxing selection
                                               // for GPIO76
#define GPIO_GPCGMUX1_GPIO77_S    26U
#define GPIO_GPCGMUX1_GPIO77_M    0xC000000U   // Defines pin-muxing selection
                                               // for GPIO77
#define GPIO_GPCGMUX1_GPIO78_S    28U
#define GPIO_GPCGMUX1_GPIO78_M    0x30000000U  // Defines pin-muxing selection
                                               // for GPIO78
#define GPIO_GPCGMUX1_GPIO79_S    30U
#define GPIO_GPCGMUX1_GPIO79_M    0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO79

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCGMUX2 register
//
//*****************************************************************************
#define GPIO_GPCGMUX2_GPIO80_S    0U
#define GPIO_GPCGMUX2_GPIO80_M    0x3U         // Defines pin-muxing selection
                                               // for GPIO80
#define GPIO_GPCGMUX2_GPIO81_S    2U
#define GPIO_GPCGMUX2_GPIO81_M    0xCU         // Defines pin-muxing selection
                                               // for GPIO81
#define GPIO_GPCGMUX2_GPIO82_S    4U
#define GPIO_GPCGMUX2_GPIO82_M    0x30U        // Defines pin-muxing selection
                                               // for GPIO82
#define GPIO_GPCGMUX2_GPIO83_S    6U
#define GPIO_GPCGMUX2_GPIO83_M    0xC0U        // Defines pin-muxing selection
                                               // for GPIO83
#define GPIO_GPCGMUX2_GPIO84_S    8U
#define GPIO_GPCGMUX2_GPIO84_M    0x300U       // Defines pin-muxing selection
                                               // for GPIO84
#define GPIO_GPCGMUX2_GPIO85_S    10U
#define GPIO_GPCGMUX2_GPIO85_M    0xC00U       // Defines pin-muxing selection
                                               // for GPIO85
#define GPIO_GPCGMUX2_GPIO86_S    12U
#define GPIO_GPCGMUX2_GPIO86_M    0x3000U      // Defines pin-muxing selection
                                               // for GPIO86
#define GPIO_GPCGMUX2_GPIO87_S    14U
#define GPIO_GPCGMUX2_GPIO87_M    0xC000U      // Defines pin-muxing selection
                                               // for GPIO87
#define GPIO_GPCGMUX2_GPIO88_S    16U
#define GPIO_GPCGMUX2_GPIO88_M    0x30000U     // Defines pin-muxing selection
                                               // for GPIO88
#define GPIO_GPCGMUX2_GPIO89_S    18U
#define GPIO_GPCGMUX2_GPIO89_M    0xC0000U     // Defines pin-muxing selection
                                               // for GPIO89
#define GPIO_GPCGMUX2_GPIO90_S    20U
#define GPIO_GPCGMUX2_GPIO90_M    0x300000U    // Defines pin-muxing selection
                                               // for GPIO90
#define GPIO_GPCGMUX2_GPIO91_S    22U
#define GPIO_GPCGMUX2_GPIO91_M    0xC00000U    // Defines pin-muxing selection
                                               // for GPIO91
#define GPIO_GPCGMUX2_GPIO92_S    24U
#define GPIO_GPCGMUX2_GPIO92_M    0x3000000U   // Defines pin-muxing selection
                                               // for GPIO92
#define GPIO_GPCGMUX2_GPIO93_S    26U
#define GPIO_GPCGMUX2_GPIO93_M    0xC000000U   // Defines pin-muxing selection
                                               // for GPIO93
#define GPIO_GPCGMUX2_GPIO94_S    28U
#define GPIO_GPCGMUX2_GPIO94_M    0x30000000U  // Defines pin-muxing selection
                                               // for GPIO94
#define GPIO_GPCGMUX2_GPIO95_S    30U
#define GPIO_GPCGMUX2_GPIO95_M    0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO95

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL1 register
//
//*****************************************************************************
#define GPIO_GPCCSEL1_GPIO64_S    0U
#define GPIO_GPCCSEL1_GPIO64_M    0xFU         // GPIO64 Master CPU Select
#define GPIO_GPCCSEL1_GPIO65_S    4U
#define GPIO_GPCCSEL1_GPIO65_M    0xF0U        // GPIO65 Master CPU Select
#define GPIO_GPCCSEL1_GPIO66_S    8U
#define GPIO_GPCCSEL1_GPIO66_M    0xF00U       // GPIO66 Master CPU Select
#define GPIO_GPCCSEL1_GPIO67_S    12U
#define GPIO_GPCCSEL1_GPIO67_M    0xF000U      // GPIO67 Master CPU Select
#define GPIO_GPCCSEL1_GPIO68_S    16U
#define GPIO_GPCCSEL1_GPIO68_M    0xF0000U     // GPIO68 Master CPU Select
#define GPIO_GPCCSEL1_GPIO69_S    20U
#define GPIO_GPCCSEL1_GPIO69_M    0xF00000U    // GPIO69 Master CPU Select
#define GPIO_GPCCSEL1_GPIO70_S    24U
#define GPIO_GPCCSEL1_GPIO70_M    0xF000000U   // GPIO70 Master CPU Select
#define GPIO_GPCCSEL1_GPIO71_S    28U
#define GPIO_GPCCSEL1_GPIO71_M    0xF0000000U  // GPIO71 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL2 register
//
//*****************************************************************************
#define GPIO_GPCCSEL2_GPIO72_S    0U
#define GPIO_GPCCSEL2_GPIO72_M    0xFU         // GPIO72 Master CPU Select
#define GPIO_GPCCSEL2_GPIO73_S    4U
#define GPIO_GPCCSEL2_GPIO73_M    0xF0U        // GPIO73 Master CPU Select
#define GPIO_GPCCSEL2_GPIO74_S    8U
#define GPIO_GPCCSEL2_GPIO74_M    0xF00U       // GPIO74 Master CPU Select
#define GPIO_GPCCSEL2_GPIO75_S    12U
#define GPIO_GPCCSEL2_GPIO75_M    0xF000U      // GPIO75 Master CPU Select
#define GPIO_GPCCSEL2_GPIO76_S    16U
#define GPIO_GPCCSEL2_GPIO76_M    0xF0000U     // GPIO76 Master CPU Select
#define GPIO_GPCCSEL2_GPIO77_S    20U
#define GPIO_GPCCSEL2_GPIO77_M    0xF00000U    // GPIO77 Master CPU Select
#define GPIO_GPCCSEL2_GPIO78_S    24U
#define GPIO_GPCCSEL2_GPIO78_M    0xF000000U   // GPIO78 Master CPU Select
#define GPIO_GPCCSEL2_GPIO79_S    28U
#define GPIO_GPCCSEL2_GPIO79_M    0xF0000000U  // GPIO79 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL3 register
//
//*****************************************************************************
#define GPIO_GPCCSEL3_GPIO80_S    0U
#define GPIO_GPCCSEL3_GPIO80_M    0xFU         // GPIO80 Master CPU Select
#define GPIO_GPCCSEL3_GPIO81_S    4U
#define GPIO_GPCCSEL3_GPIO81_M    0xF0U        // GPIO81 Master CPU Select
#define GPIO_GPCCSEL3_GPIO82_S    8U
#define GPIO_GPCCSEL3_GPIO82_M    0xF00U       // GPIO82 Master CPU Select
#define GPIO_GPCCSEL3_GPIO83_S    12U
#define GPIO_GPCCSEL3_GPIO83_M    0xF000U      // GPIO83 Master CPU Select
#define GPIO_GPCCSEL3_GPIO84_S    16U
#define GPIO_GPCCSEL3_GPIO84_M    0xF0000U     // GPIO84 Master CPU Select
#define GPIO_GPCCSEL3_GPIO85_S    20U
#define GPIO_GPCCSEL3_GPIO85_M    0xF00000U    // GPIO85 Master CPU Select
#define GPIO_GPCCSEL3_GPIO86_S    24U
#define GPIO_GPCCSEL3_GPIO86_M    0xF000000U   // GPIO86 Master CPU Select
#define GPIO_GPCCSEL3_GPIO87_S    28U
#define GPIO_GPCCSEL3_GPIO87_M    0xF0000000U  // GPIO87 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCSEL4 register
//
//*****************************************************************************
#define GPIO_GPCCSEL4_GPIO88_S    0U
#define GPIO_GPCCSEL4_GPIO88_M    0xFU         // GPIO88 Master CPU Select
#define GPIO_GPCCSEL4_GPIO89_S    4U
#define GPIO_GPCCSEL4_GPIO89_M    0xF0U        // GPIO89 Master CPU Select
#define GPIO_GPCCSEL4_GPIO90_S    8U
#define GPIO_GPCCSEL4_GPIO90_M    0xF00U       // GPIO90 Master CPU Select
#define GPIO_GPCCSEL4_GPIO91_S    12U
#define GPIO_GPCCSEL4_GPIO91_M    0xF000U      // GPIO91 Master CPU Select
#define GPIO_GPCCSEL4_GPIO92_S    16U
#define GPIO_GPCCSEL4_GPIO92_M    0xF0000U     // GPIO92 Master CPU Select
#define GPIO_GPCCSEL4_GPIO93_S    20U
#define GPIO_GPCCSEL4_GPIO93_M    0xF00000U    // GPIO93 Master CPU Select
#define GPIO_GPCCSEL4_GPIO94_S    24U
#define GPIO_GPCCSEL4_GPIO94_M    0xF000000U   // GPIO94 Master CPU Select
#define GPIO_GPCCSEL4_GPIO95_S    28U
#define GPIO_GPCCSEL4_GPIO95_M    0xF0000000U  // GPIO95 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCLOCK register
//
//*****************************************************************************
#define GPIO_GPCLOCK_GPIO64       0x1U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO65       0x2U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO66       0x4U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO67       0x8U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO68       0x10U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO69       0x20U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO70       0x40U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO71       0x80U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO72       0x100U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO73       0x200U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO74       0x400U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO75       0x800U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO76       0x1000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO77       0x2000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO78       0x4000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO79       0x8000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO80       0x10000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO81       0x20000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO82       0x40000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO83       0x80000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO84       0x100000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO85       0x200000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO86       0x400000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO87       0x800000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO88       0x1000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO89       0x2000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO90       0x4000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO91       0x8000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO92       0x10000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO93       0x20000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO94       0x40000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPCLOCK_GPIO95       0x80000000U  // Configuration Lock bit for
                                               // this pin

