tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPEMUX2 register
//
//*****************************************************************************
#define GPIO_GPEMUX2_GPIO144_S    0U
#define GPIO_GPEMUX2_GPIO144_M    0x3U         // Defines pin-muxing selection
                                               // for GPIO144
#define GPIO_GPEMUX2_GPIO145_S    2U
#define GPIO_GPEMUX2_GPIO145_M    0xCU         // Defines pin-muxing selection
                                               // for GPIO145
#define GPIO_GPEMUX2_GPIO146_S    4U
#define GPIO_GPEMUX2_GPIO146_M    0x30U        // Defines pin-muxing selection
                                               // for GPIO146
#define GPIO_GPEMUX2_GPIO147_S    6U
#define GPIO_GPEMUX2_GPIO147_M    0xC0U        // Defines pin-muxing selection
                                               // for GPIO147
#define GPIO_GPEMUX2_GPIO148_S    8U
#define GPIO_GPEMUX2_GPIO148_M    0x300U       // Defines pin-muxing selection
                                               // for GPIO148
#define GPIO_GPEMUX2_GPIO149_S    10U
#define GPIO_GPEMUX2_GPIO149_M    0xC00U       // Defines pin-muxing selection
                                               // for GPIO149
#define GPIO_GPEMUX2_GPIO150_S    12U
#define GPIO_GPEMUX2_GPIO150_M    0x3000U      // Defines pin-muxing selection
                                               // for GPIO150
#define GPIO_GPEMUX2_GPIO151_S    14U
#define GPIO_GPEMUX2_GPIO151_M    0xC000U      // Defines pin-muxing selection
                                               // for GPIO151
#define GPIO_GPEMUX2_GPIO152_S    16U
#define GPIO_GPEMUX2_GPIO152_M    0x30000U     // Defines pin-muxing selection
                                               // for GPIO152
#define GPIO_GPEMUX2_GPIO153_S    18U
#define GPIO_GPEMUX2_GPIO153_M    0xC0000U     // Defines pin-muxing selection
                                               // for GPIO153
#define GPIO_GPEMUX2_GPIO154_S    20U
#define GPIO_GPEMUX2_GPIO154_M    0x300000U    // Defines pin-muxing selection
                                               // for GPIO154
#define GPIO_GPEMUX2_GPIO155_S    22U
#define GPIO_GPEMUX2_GPIO155_M    0xC00000U    // Defines pin-muxing selection
                                               // for GPIO155
#define GPIO_GPEMUX2_GPIO156_S    24U
#define GPIO_GPEMUX2_GPIO156_M    0x3000000U   // Defines pin-muxing selection
                                               // for GPIO156
#define GPIO_GPEMUX2_GPIO157_S    26U
#define GPIO_GPEMUX2_GPIO157_M    0xC000000U   // Defines pin-muxing selection
                                               // for GPIO157
#define GPIO_GPEMUX2_GPIO158_S    28U
#define GPIO_GPEMUX2_GPIO158_M    0x30000000U  // Defines pin-muxing selection
                                               // for GPIO158
#define GPIO_GPEMUX2_GPIO159_S    30U
#define GPIO_GPEMUX2_GPIO159_M    0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO159

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEDIR register
//
//*****************************************************************************
#define GPIO_GPEDIR_GPIO128       0x1U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO129       0x2U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO130       0x4U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO131       0x8U         // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO132       0x10U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO133       0x20U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO134       0x40U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO135       0x80U        // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO136       0x100U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO137       0x200U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO138       0x400U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO139       0x800U       // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO140       0x1000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO141       0x2000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO142       0x4000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO143       0x8000U      // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO144       0x10000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO145       0x20000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO146       0x40000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO147       0x80000U     // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO148       0x100000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO149       0x200000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO150       0x400000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO151       0x800000U    // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO152       0x1000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO153       0x2000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO154       0x4000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO155       0x8000000U   // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO156       0x10000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO157       0x20000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO158       0x40000000U  // Defines direction for this
                                               // pin in GPIO mode
#define GPIO_GPEDIR_GPIO159       0x80000000U  // Defines direction for this
                                               // pin in GPIO mode

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEPUD register
//
//*****************************************************************************
#define GPIO_GPEPUD_GPIO128       0x1U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO129       0x2U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO130       0x4U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO131       0x8U         // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO132       0x10U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO133       0x20U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO134       0x40U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO135       0x80U        // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO136       0x100U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO137       0x200U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO138       0x400U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO139       0x800U       // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO140       0x1000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO141       0x2000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO142       0x4000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO143       0x8000U      // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO144       0x10000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO145       0x20000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO146       0x40000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO147       0x80000U     // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO148       0x100000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO149       0x200000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO150       0x400000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO151       0x800000U    // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO152       0x1000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO153       0x2000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO154       0x4000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO155       0x8000000U   // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO156       0x10000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO157       0x20000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO158       0x40000000U  // Pull-Up Disable control for
                                               // this pin
#define GPIO_GPEPUD_GPIO159       0x80000000U  // Pull-Up Disable control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEINV register
//
//*****************************************************************************
#define GPIO_GPEINV_GPIO128       0x1U         // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO129       0x2U         // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO130       0x4U         // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO131       0x8U         // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO132       0x10U        // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO133       0x20U        // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO134       0x40U        // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO135       0x80U        // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO136       0x100U       // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO137       0x200U       // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO138       0x400U       // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO139       0x800U       // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO140       0x1000U      // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO141       0x2000U      // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO142       0x4000U      // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO143       0x8000U      // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO144       0x10000U     // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO145       0x20000U     // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO146       0x40000U     // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO147       0x80000U     // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO148       0x100000U    // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO149       0x200000U    // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO150       0x400000U    // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO151       0x800000U    // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO152       0x1000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO153       0x2000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO154       0x4000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO155       0x8000000U   // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO156       0x10000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO157       0x20000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO158       0x40000000U  // Input inversion control for
                                               // this pin
#define GPIO_GPEINV_GPIO159       0x80000000U  // Input inversion control for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEODR register
//
//*****************************************************************************
#define GPIO_GPEODR_GPIO128       0x1U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO129       0x2U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO130       0x4U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO131       0x8U         // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO132       0x10U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO133       0x20U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO134       0x40U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO135       0x80U        // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO136       0x100U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO137       0x200U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO138       0x400U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO139       0x800U       // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO140       0x1000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO141       0x2000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO142       0x4000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO143       0x8000U      // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO144       0x10000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO145       0x20000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO146       0x40000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO147       0x80000U     // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO148       0x100000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO149       0x200000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO150       0x400000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO151       0x800000U    // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO152       0x1000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO153       0x2000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO154       0x4000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO155       0x8000000U   // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO156       0x10000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO157       0x20000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO158       0x40000000U  // Outpout Open-Drain control
                                               // for this pin
#define GPIO_GPEODR_GPIO159       0x80000000U  // Outpout Open-Drain control
                                               // for this pin

