tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPEGMUX1 register
//
//*****************************************************************************
#define GPIO_GPEGMUX1_GPIO128_S   0U
#define GPIO_GPEGMUX1_GPIO128_M   0x3U         // Defines pin-muxing selection
                                               // for GPIO128
#define GPIO_GPEGMUX1_GPIO129_S   2U
#define GPIO_GPEGMUX1_GPIO129_M   0xCU         // Defines pin-muxing selection
                                               // for GPIO129
#define GPIO_GPEGMUX1_GPIO130_S   4U
#define GPIO_GPEGMUX1_GPIO130_M   0x30U        // Defines pin-muxing selection
                                               // for GPIO130
#define GPIO_GPEGMUX1_GPIO131_S   6U
#define GPIO_GPEGMUX1_GPIO131_M   0xC0U        // Defines pin-muxing selection
                                               // for GPIO131
#define GPIO_GPEGMUX1_GPIO132_S   8U
#define GPIO_GPEGMUX1_GPIO132_M   0x300U       // Defines pin-muxing selection
                                               // for GPIO132
#define GPIO_GPEGMUX1_GPIO133_S   10U
#define GPIO_GPEGMUX1_GPIO133_M   0xC00U       // Defines pin-muxing selection
                                               // for GPIO133
#define GPIO_GPEGMUX1_GPIO134_S   12U
#define GPIO_GPEGMUX1_GPIO134_M   0x3000U      // Defines pin-muxing selection
                                               // for GPIO134
#define GPIO_GPEGMUX1_GPIO135_S   14U
#define GPIO_GPEGMUX1_GPIO135_M   0xC000U      // Defines pin-muxing selection
                                               // for GPIO135
#define GPIO_GPEGMUX1_GPIO136_S   16U
#define GPIO_GPEGMUX1_GPIO136_M   0x30000U     // Defines pin-muxing selection
                                               // for GPIO136
#define GPIO_GPEGMUX1_GPIO137_S   18U
#define GPIO_GPEGMUX1_GPIO137_M   0xC0000U     // Defines pin-muxing selection
                                               // for GPIO137
#define GPIO_GPEGMUX1_GPIO138_S   20U
#define GPIO_GPEGMUX1_GPIO138_M   0x300000U    // Defines pin-muxing selection
                                               // for GPIO138
#define GPIO_GPEGMUX1_GPIO139_S   22U
#define GPIO_GPEGMUX1_GPIO139_M   0xC00000U    // Defines pin-muxing selection
                                               // for GPIO139
#define GPIO_GPEGMUX1_GPIO140_S   24U
#define GPIO_GPEGMUX1_GPIO140_M   0x3000000U   // Defines pin-muxing selection
                                               // for GPIO140
#define GPIO_GPEGMUX1_GPIO141_S   26U
#define GPIO_GPEGMUX1_GPIO141_M   0xC000000U   // Defines pin-muxing selection
                                               // for GPIO141
#define GPIO_GPEGMUX1_GPIO142_S   28U
#define GPIO_GPEGMUX1_GPIO142_M   0x30000000U  // Defines pin-muxing selection
                                               // for GPIO142
#define GPIO_GPEGMUX1_GPIO143_S   30U
#define GPIO_GPEGMUX1_GPIO143_M   0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO143

//*****************************************************************************
//
// The following are defines for the bit fields in the GPEGMUX2 register
//
//*****************************************************************************
#define GPIO_GPEGMUX2_GPIO144_S   0U
#define GPIO_GPEGMUX2_GPIO144_M   0x3U         // Defines pin-muxing selection
                                               // for GPIO144
#define GPIO_GPEGMUX2_GPIO145_S   2U
#define GPIO_GPEGMUX2_GPIO145_M   0xCU         // Defines pin-muxing selection
                                               // for GPIO145
#define GPIO_GPEGMUX2_GPIO146_S   4U
#define GPIO_GPEGMUX2_GPIO146_M   0x30U        // Defines pin-muxing selection
                                               // for GPIO146
#define GPIO_GPEGMUX2_GPIO147_S   6U
#define GPIO_GPEGMUX2_GPIO147_M   0xC0U        // Defines pin-muxing selection
                                               // for GPIO147
#define GPIO_GPEGMUX2_GPIO148_S   8U
#define GPIO_GPEGMUX2_GPIO148_M   0x300U       // Defines pin-muxing selection
                                               // for GPIO148
#define GPIO_GPEGMUX2_GPIO149_S   10U
#define GPIO_GPEGMUX2_GPIO149_M   0xC00U       // Defines pin-muxing selection
                                               // for GPIO149
#define GPIO_GPEGMUX2_GPIO150_S   12U
#define GPIO_GPEGMUX2_GPIO150_M   0x3000U      // Defines pin-muxing selection
                                               // for GPIO150
#define GPIO_GPEGMUX2_GPIO151_S   14U
#define GPIO_GPEGMUX2_GPIO151_M   0xC000U      // Defines pin-muxing selection
                                               // for GPIO151
#define GPIO_GPEGMUX2_GPIO152_S   16U
#define GPIO_GPEGMUX2_GPIO152_M   0x30000U     // Defines pin-muxing selection
                                               // for GPIO152
#define GPIO_GPEGMUX2_GPIO153_S   18U
#define GPIO_GPEGMUX2_GPIO153_M   0xC0000U     // Defines pin-muxing selection
                                               // for GPIO153
#define GPIO_GPEGMUX2_GPIO154_S   20U
#define GPIO_GPEGMUX2_GPIO154_M   0x300000U    // Defines pin-muxing selection
                                               // for GPIO154
#define GPIO_GPEGMUX2_GPIO155_S   22U
#define GPIO_GPEGMUX2_GPIO155_M   0xC00000U    // Defines pin-muxing selection
                                               // for GPIO155
#define GPIO_GPEGMUX2_GPIO156_S   24U
#define GPIO_GPEGMUX2_GPIO156_M   0x3000000U   // Defines pin-muxing selection
                                               // for GPIO156
#define GPIO_GPEGMUX2_GPIO157_S   26U
#define GPIO_GPEGMUX2_GPIO157_M   0xC000000U   // Defines pin-muxing selection
                                               // for GPIO157
#define GPIO_GPEGMUX2_GPIO158_S   28U
#define GPIO_GPEGMUX2_GPIO158_M   0x30000000U  // Defines pin-muxing selection
                                               // for GPIO158
#define GPIO_GPEGMUX2_GPIO159_S   30U
#define GPIO_GPEGMUX2_GPIO159_M   0xC0000000U  // Defines pin-muxing selection
                                               // for GPIO159

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECSEL1 register
//
//*****************************************************************************
#define GPIO_GPECSEL1_GPIO128_S   0U
#define GPIO_GPECSEL1_GPIO128_M   0xFU         // GPIO128 Master CPU Select
#define GPIO_GPECSEL1_GPIO129_S   4U
#define GPIO_GPECSEL1_GPIO129_M   0xF0U        // GPIO129 Master CPU Select
#define GPIO_GPECSEL1_GPIO130_S   8U
#define GPIO_GPECSEL1_GPIO130_M   0xF00U       // GPIO130 Master CPU Select
#define GPIO_GPECSEL1_GPIO131_S   12U
#define GPIO_GPECSEL1_GPIO131_M   0xF000U      // GPIO131 Master CPU Select
#define GPIO_GPECSEL1_GPIO132_S   16U
#define GPIO_GPECSEL1_GPIO132_M   0xF0000U     // GPIO132 Master CPU Select
#define GPIO_GPECSEL1_GPIO133_S   20U
#define GPIO_GPECSEL1_GPIO133_M   0xF00000U    // GPIO133 Master CPU Select
#define GPIO_GPECSEL1_GPIO134_S   24U
#define GPIO_GPECSEL1_GPIO134_M   0xF000000U   // GPIO134 Master CPU Select
#define GPIO_GPECSEL1_GPIO135_S   28U
#define GPIO_GPECSEL1_GPIO135_M   0xF0000000U  // GPIO135 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECSEL2 register
//
//*****************************************************************************
#define GPIO_GPECSEL2_GPIO136_S   0U
#define GPIO_GPECSEL2_GPIO136_M   0xFU         // GPIO136 Master CPU Select
#define GPIO_GPECSEL2_GPIO137_S   4U
#define GPIO_GPECSEL2_GPIO137_M   0xF0U        // GPIO137 Master CPU Select
#define GPIO_GPECSEL2_GPIO138_S   8U
#define GPIO_GPECSEL2_GPIO138_M   0xF00U       // GPIO138 Master CPU Select
#define GPIO_GPECSEL2_GPIO139_S   12U
#define GPIO_GPECSEL2_GPIO139_M   0xF000U      // GPIO139 Master CPU Select
#define GPIO_GPECSEL2_GPIO140_S   16U
#define GPIO_GPECSEL2_GPIO140_M   0xF0000U     // GPIO140 Master CPU Select
#define GPIO_GPECSEL2_GPIO141_S   20U
#define GPIO_GPECSEL2_GPIO141_M   0xF00000U    // GPIO141 Master CPU Select
#define GPIO_GPECSEL2_GPIO142_S   24U
#define GPIO_GPECSEL2_GPIO142_M   0xF000000U   // GPIO142 Master CPU Select
#define GPIO_GPECSEL2_GPIO143_S   28U
#define GPIO_GPECSEL2_GPIO143_M   0xF0000000U  // GPIO143 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECSEL3 register
//
//*****************************************************************************
#define GPIO_GPECSEL3_GPIO144_S   0U
#define GPIO_GPECSEL3_GPIO144_M   0xFU         // GPIO144 Master CPU Select
#define GPIO_GPECSEL3_GPIO145_S   4U
#define GPIO_GPECSEL3_GPIO145_M   0xF0U        // GPIO145 Master CPU Select
#define GPIO_GPECSEL3_GPIO146_S   8U
#define GPIO_GPECSEL3_GPIO146_M   0xF00U       // GPIO146 Master CPU Select
#define GPIO_GPECSEL3_GPIO147_S   12U
#define GPIO_GPECSEL3_GPIO147_M   0xF000U      // GPIO147 Master CPU Select
#define GPIO_GPECSEL3_GPIO148_S   16U
#define GPIO_GPECSEL3_GPIO148_M   0xF0000U     // GPIO148 Master CPU Select
#define GPIO_GPECSEL3_GPIO149_S   20U
#define GPIO_GPECSEL3_GPIO149_M   0xF00000U    // GPIO149 Master CPU Select
#define GPIO_GPECSEL3_GPIO150_S   24U
#define GPIO_GPECSEL3_GPIO150_M   0xF000000U   // GPIO150 Master CPU Select
#define GPIO_GPECSEL3_GPIO151_S   28U
#define GPIO_GPECSEL3_GPIO151_M   0xF0000000U  // GPIO151 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECSEL4 register
//
//*****************************************************************************
#define GPIO_GPECSEL4_GPIO152_S   0U
#define GPIO_GPECSEL4_GPIO152_M   0xFU         // GPIO152 Master CPU Select
#define GPIO_GPECSEL4_GPIO153_S   4U
#define GPIO_GPECSEL4_GPIO153_M   0xF0U        // GPIO153 Master CPU Select
#define GPIO_GPECSEL4_GPIO154_S   8U
#define GPIO_GPECSEL4_GPIO154_M   0xF00U       // GPIO154 Master CPU Select
#define GPIO_GPECSEL4_GPIO155_S   12U
#define GPIO_GPECSEL4_GPIO155_M   0xF000U      // GPIO155 Master CPU Select
#define GPIO_GPECSEL4_GPIO156_S   16U
#define GPIO_GPECSEL4_GPIO156_M   0xF0000U     // GPIO156 Master CPU Select
#define GPIO_GPECSEL4_GPIO157_S   20U
#define GPIO_GPECSEL4_GPIO157_M   0xF00000U    // GPIO157 Master CPU Select
#define GPIO_GPECSEL4_GPIO158_S   24U
#define GPIO_GPECSEL4_GPIO158_M   0xF000000U   // GPIO158 Master CPU Select
#define GPIO_GPECSEL4_GPIO159_S   28U
#define GPIO_GPECSEL4_GPIO159_M   0xF0000000U  // GPIO159 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPELOCK register
//
//*****************************************************************************
#define GPIO_GPELOCK_GPIO128      0x1U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO129      0x2U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO130      0x4U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO131      0x8U         // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO132      0x10U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO133      0x20U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO134      0x40U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO135      0x80U        // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO136      0x100U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO137      0x200U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO138      0x400U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO139      0x800U       // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO140      0x1000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO141      0x2000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO142      0x4000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO143      0x8000U      // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO144      0x10000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO145      0x20000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO146      0x40000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO147      0x80000U     // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO148      0x100000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO149      0x200000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO150      0x400000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO151      0x800000U    // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO152      0x1000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO153      0x2000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO154      0x4000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO155      0x8000000U   // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO156      0x10000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO157      0x20000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO158      0x40000000U  // Configuration Lock bit for
                                               // this pin
#define GPIO_GPELOCK_GPIO159      0x80000000U  // Configuration Lock bit for
                                               // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPECR register
//
//*****************************************************************************
#define GPIO_GPECR_GPIO128        0x1U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO129        0x2U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO130        0x4U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO131        0x8U         // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO132        0x10U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO133        0x20U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO134        0x40U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO135        0x80U        // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO136        0x100U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO137        0x200U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO138        0x400U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO139        0x800U       // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO140        0x1000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO141        0x2000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO142        0x4000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO143        0x8000U      // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO144        0x10000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO145        0x20000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO146        0x40000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO147        0x80000U     // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO148        0x100000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO149        0x200000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO150        0x400000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO151        0x800000U    // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO152        0x1000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO153        0x2000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO154        0x4000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO155        0x8000000U   // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO156        0x10000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO157        0x20000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO158        0x40000000U  // Configuration lock commit bit
                                               // for this pin
#define GPIO_GPECR_GPIO159        0x80000000U  // Configuration lock commit bit
                                               // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFCTRL register
//
//*****************************************************************************
#define GPIO_GPFCTRL_QUALPRD0_S   0U
#define GPIO_GPFCTRL_QUALPRD0_M   0xFFU        // Qualification sampling period
                                               // for GPIO160 to GPIO167
#define GPIO_GPFCTRL_QUALPRD1_S   8U
#define GPIO_GPFCTRL_QUALPRD1_M   0xFF00U      // Qualification sampling period
                                               // for GPIO168

//*****************************************************************************
//
// The following are defines for the bit fields in the GPFQSEL1 register
//
//*****************************************************************************
#define GPIO_GPFQSEL1_GPIO160_S   0U
#define GPIO_GPFQSEL1_GPIO160_M   0x3U         // Select input qualification
                                               // type for GPIO160
#define GPIO_GPFQSEL1_GPIO161_S   2U
#define GPIO_GPFQSEL1_GPIO161_M   0xCU         // Select input qualification
                                               // type for GPIO161
#define GPIO_GPFQSEL1_GPIO162_S   4U
#define GPIO_GPFQSEL1_GPIO162_M   0x30U        // Select input qualification
                                               // type for GPIO162
#define GPIO_GPFQSEL1_GPIO163_S   6U
#define GPIO_GPFQSEL1_GPIO163_M   0xC0U        // Select input qualification
                                               // type for GPIO163
#define GPIO_GPFQSEL1_GPIO164_S   8U
#define GPIO_GPFQSEL1_GPIO164_M   0x300U       // Select input qualification
                                               // type for GPIO164
#define GPIO_GPFQSEL1_GPIO165_S   10U
#define GPIO_GPFQSEL1_GPIO165_M   0xC00U       // Select input qualification
                                               // type for GPIO165
#define GPIO_GPFQSEL1_GPIO166_S   12U
#define GPIO_GPFQSEL1_GPIO166_M   0x3000U      // Select input qualification
                                               // type for GPIO166
#define GPIO_GPFQSEL1_GPIO167_S   14U
#define GPIO_GPFQSEL1_GPIO167_M   0xC000U      // Select input qualification
                                               // type for GPIO167
#define GPIO_GPFQSEL1_GPIO168_S   16U
#define GPIO_GPFQSEL1_GPIO168_M   0x30000U     // Select input qualification
                                               // type for GPIO168

